
WRONG_COMMAND = "Введена некорректная команда"
WRONG_COMMAND_ARGUMENTS = "Неверные аргументы для команды"

HELP_MESSAGE = """Команды для взаимодействия с менеджером заметок:
1. exit - чтобы выйти из программы
2. help - показать это сообщение
3. create - создать новую заметку
4. show - посмотреть все существующие заметки
5. show <id> - показать заметку с определенным id
6. delete <id> - удалить заметку с указанным id
7. update <id> - обновить указанную заметку
"""

CREATE_HEAD_MESSAGE = "Введите название заметки: "
CREATE_BODY_MESSAGE = "Напишите что-угодно и нажмите enter: "

UPDATE_MESSAGE = "Укажите новое содержание: "

NOTE_DOES_NOT_EXIST = "Заметки с таким номером не существует"
SUCCESSFUL_DELETE = "Заметка успешно удалена"
SCRIPT_EXIT = "Выход из программы"
